app/Controllers/CategoryController.php

SELECT *
FROM `categories`
SELECT *
FROM `categories`
WHERE `id` = '2'
 LIMIT 1
SELECT *
FROM `products`
WHERE `categoria` = '2'
SELECT *
FROM `product_images`
WHERE `product_id` = '5'
SELECT *
FROM `users`
WHERE `ra` = '1979693'
 LIMIT 1
---
    public function search($id)
    {
        if (!session()->get('logged_in')){
            return redirect()->to(base_url('/enter'));
        }

        $agent = $this->request->getUserAgent();

        $catModel = new Category();
        $prodModel = new Product();
        $imgModel = new ProductImages();
        $userModel = new User();

        $allCategories = $catModel->findAll();

        $category = $catModel->where('id', $id)->first();

        $products = $prodModel->where('categoria', $category->id)->findAll();


        if (count($products) > 0) {
            foreach ($products as $item) {
                $item->image = $imgModel->where('product_id', $item->id)->findAll();
                $item->vendedor = $userModel->where('ra', $item->vendedor)->first();