app/Controllers/EventController.php

SELECT *
FROM `events`
SELECT *
FROM `categories`
---
    public function getAll(){
        if (!session()->get('logged_in')){
            return redirect()->to(base_url('/enter'));
        }

        $eventModel = new Event();

        $eventos = $eventModel->findAll();

        $catModel = new Category();
        $categories = $catModel->findAll();