app/Controllers/Home.php

SELECT *
FROM `categories`
SELECT *
FROM `products`
WHERE `categoria` = '1'
SELECT *
FROM `users`
WHERE `ra` = '1979693'
 LIMIT 1
SELECT *
FROM `cursos`
WHERE `id` = '1'
 LIMIT 1
SELECT *
FROM `categories`
WHERE `id` = '1'
 LIMIT 1
---
    public function index()
    {
        if (!session()->get('logged_in')){
            return redirect()->to(base_url('/enter'));
        }

        $agent = $this->request->getUserAgent();

        $prodShow1 = [];
        $prodShow2 = [];

        $productModel = new Product();
        $userModel = new User();
        $categoryModel = new Category();

        $allCategories = $categoryModel->findAll();

        $categoryId1 = 0;
        $categoryId2 = 0;

        foreach ($allCategories as $key => $item) {
            if ($key == 0) {
                $categoryId1 = $item->id;
            } elseif ($key == 1) {
                $categoryId2 = $item->id;
            }
        }

        if ($categoryId1) {
            $prodShow1 = $productModel->where('categoria', $categoryId1)->findAll();
            foreach ($prodShow1 as $item){
                $item->vendedor = $userModel->where('ra', $item->vendedor)->first();
                $cursoModel = new Curso;
                $item->vendedor->curso = $cursoModel->where('id', $item->vendedor->curso)->first();
            }

            $category1 = $categoryModel->where('id', $categoryId1)->first();

SELECT *
FROM `products`
WHERE `categoria` = '2'
SELECT *
FROM `users`
WHERE `ra` = '123123'
 LIMIT 1
SELECT *
FROM `cursos`
WHERE `id` = '1'
 LIMIT 1
SELECT *
FROM `categories`
WHERE `id` = '2'
 LIMIT 1
---
        }

        if ($categoryId2) {
            $prodShow2 = $productModel->where('categoria', $categoryId2)->findAll();
            foreach ($prodShow2 as $item){
                $item->vendedor = $userModel->where('ra', $item->vendedor)->first();
                $cursoModel = new Curso;
                $item->vendedor->curso = $cursoModel->where('id', $item->vendedor->curso)->first();
            }

            $category2 = $categoryModel->where('id', $categoryId2)->first();

SELECT *
FROM `categories`
SELECT *
FROM `users`
WHERE `ra` = '123456789'
 LIMIT 1
SELECT *
FROM `products`
WHERE `vendedor` = '123456789'
SELECT *
FROM `cursos`
WHERE `id` = '1'
 LIMIT 1
---
    public function myproducts($ra)
    {
        if (!session()->get('logged_in')){
            return redirect()->to(base_url('/enter'));
        }

        $agent = $this->request->getUserAgent();

        $categoryModel = new Category();

        $allCategories = $categoryModel->findAll();

        $productModel = new Product();
        $userModel = new User();

        $user = $userModel->where('ra', $ra)->first();
        $products = $productModel->where('vendedor', $ra)->findAll();

        $cursoModel = new Curso;
        $user->curso = $cursoModel->where('id', $user->curso)->first();

        $avalModel = new Avaliacao();
        $avaliacoes = $avalModel->where('user', $ra)->findAll();
        foreach ($avaliacoes as $key => $value) {
            $value->user = $userModel->where('ra', $value->user)->first();