app/Controllers/ProductController.php

    public function productInfo($id){

        if (!session()->get('logged_in')){
            return redirect()->to(base_url('/enter'));
        }

        $productModel = new Product();
        $product = $productModel->where('id', $id)->first();

        if (!$product) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound("Produto não encontrado");
        }

        $userModel = new User();
        $user = $userModel->where('ra', $product->vendedor)->first();

        $cursoModel = new Curso;
        $user->curso = $cursoModel->where('id', $user->curso)->first();

        if (!$user) {
            $user->name = 'Usuário não encontrado';
            $user->images = base_url('/assets/img/no-image.png');
        }

        $avalModel = new Avaliacao();
        $feedbackConfirmed = $avalModel->where('user', session()->get('ra'))->where('product', $product->id)->first();
        $avaliacoes = $avalModel->where('product', $product->id)->findAll();

        foreach ($avaliacoes as $key => $item) {
            $item->user = $userModel->where('ra', $item->user)->first();
        }

        $categoryModel = new Category();
        $allCategories = $categoryModel->findAll();
---
SELECT *
FROM `products`
WHERE `id` = '1'
 LIMIT 1
SELECT *
FROM `users`
WHERE `ra` = '1979693'
 LIMIT 1
SELECT *
FROM `cursos`
WHERE `id` = '1'
 LIMIT 1
SELECT *
FROM `categories`