app/Controllers/ProductController.php

    public function search()
    {
        $query = $this->request->getVar('query');

        $agent = $this->request->getUserAgent();
        $catModel = new Category();
        $userModel = new User();
        $categories = $catModel->findAll();

        if (!$query) {
            return view('notFind', [
                'categories' => $categories,
                'isMobile' => $agent->isMobile()
            ]);
        }

        $productModel = new Product();
        $imageModel = new ProductImages();

        $products = $productModel->like('nome', $query, 'both')->orLike('tags', $query, 'both')->findAll();

        if (count($products) > 0) {
            foreach ($products as $item) {
                $item->image = $imageModel->where('product_id', $item->id)->findAll();
                $item->vendedor =  $userModel->where('ra', $item->vendedor)->first();
---
SELECT *
FROM `categories`
SELECT *
FROM `products`
WHERE `nome` LIKE '%roupa%' ESCAPE '!'
OR  `tags` LIKE '%roupa%' ESCAPE '!'
SELECT *
FROM `product_images`
WHERE `product_id` = '4'
SELECT *
FROM `users`
WHERE `ra` = '1979693'
 LIMIT 1